function getRate() {
    var doc = fl.getDocumentDOM(); //文档

    const frameRate = doc!.frameRate; //帧率
    return frameRate;
}

export const JSFLNumerics = {
    // --------------------------------------------------------------------------------
    // # bitmap
    bitmap: {},

    // --------------------------------------------------------------------------------
    // # element
    element: {},

    // --------------------------------------------------------------------------------
    // # filter
    filter: {
        blur: {
            MIN_BLUR: 0,
            MAX_BLUR: 255
        }
    },

    // --------------------------------------------------------------------------------
    // # fill
    fill: {},

    // --------------------------------------------------------------------------------
    // # frame
    frame: {
        /**
         * frame.frameRate
         * 不同时间维度的帧率
         */
        frameRate: {
            FPS: getRate(), // 每秒帧数（Frames Per Second）
            FPM: getRate() * 60, // 每分钟帧数（Frames Per Minute）
            FPH: getRate() * 60 * 60, // 每小时帧数（Frames Per Hour）
            FPD: getRate() * 60 * 60 * 24, // 每天帧数（Frames Per Day）
            FPW: getRate() * 60 * 60 * 24 * 7, // 每周帧数（Frames Per Week）
            FPMonth: getRate() * 60 * 60 * 24 * 30, // 每月帧数（Frames Per Month，假设每月30天）
            FPY: getRate() * 60 * 60 * 24 * 365 // 每年帧数（Frames Per Year）
        },
        /**
         * 为了方便使用，定义了一些常用的帧列表
         * 更多的是为了兼容以前的代码
         */
        frameList: {
            FRAME_1: 1 - 1,
            FRAME_2: 2 - 1,
            FRAME_3: 3 - 1,
            FRAME_4: 4 - 1,
            FRAME_5: 5 - 1,
            FRAME_6: 6 - 1,
            FRAME_7: 7 - 1,
            FRAME_8: 8 - 1,
            FRAME_9: 9 - 1,
            FRAME_10: 10 - 1,
            FRAME_11: 11 - 1,
            FRAME_12: 12 - 1,
            FRAME_13: 13 - 1,
            FRAME_14: 14 - 1,
            FRAME_15: 15 - 1,
            FRAME_16: 16 - 1,
            FRAME_17: 17 - 1,
            FRAME_18: 18 - 1,
            FRAME_19: 19 - 1,
            FRAME_20: 20 - 1,
            // FRAME_21: 21 - 1,
            // FRAME_22: 22 - 1,
            // FRAME_23: 23 - 1,
            // FRAME_24: 24 - 1,
            // FRAME_25: 25 - 1,
            // FRAME_26: 26 - 1,
            // FRAME_27: 27 - 1,
            // FRAME_28: 28 - 1,
            // FRAME_29: 29 - 1,
            FRAME_30: 30 - 1,
            FRAME_31: 31 - 1,
            FRAME_40: 40 - 1,
            FRAME_41: 40 - 1,
            FRAME_45: 45 - 1,
            FRAME_90: 90 - 1
        }
    },

    // --------------------------------------------------------------------------------
    // # instance
    instance: {},

    // --------------------------------------------------------------------------------
    // # item
    item: {},

    // --------------------------------------------------------------------------------
    // # layer
    layer: {},

    // --------------------------------------------------------------------------------
    // # parameter
    parameter: {},

    // --------------------------------------------------------------------------------
    // # symbol
    symbol: {},

    // --------------------------------------------------------------------------------
    // # sound
    sound: {
        channel: {
            MIN_CHANNEL: 0,
            /**
             * 最大声道数,最大音量  100%
             * @type {number}
             * @note 16 位有符号整数的最大值（32767）
             */
            MAX_CHANNEL: 32768
        },
        envelope: {
            /**
             * 音轨拆分长度
             * @type {number}
             * @description 音轨拆分长度，单位：帧
             *              var soundEnvelopeLimits = frame.getSoundEnvelopeLimits();
             * @note 不清楚为什么 每一秒的envelope长度是 1472 值，怎么得到的，更是不知道，完全的来自 参考项目 WindowSWF
             * @see https://gitee.com/ninge/WindowSWF/tree/master/
             */
            ENVELOPE_PER_FRAME: 1472,

            MIN_ENVELOPE: 0,
            /**
             * 最大音轨拆分长度,相当于 无穷大
             * @type {number}
             * @note 存储容量的上限为 1073741823，即 2^30 - 1 kB，即 1024 MB, 1GB
             */
            MAX_ENVELOPE: 1073741823
        }
    },

    // --------------------------------------------------------------------------------
    // # stroke
    stroke: {},

    // --------------------------------------------------------------------------------
    // # text
    text: {},

    // --------------------------------------------------------------------------------
    // # transform
    transform: {},

    // --------------------------------------------------------------------------------
    // # video
    video: {}
};
